using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace NumberToText.Shared.Static
{
    internal static class WordExceptions
    {
        public static readonly HashSet<string> NonDeclensionWords = new HashSet<string>(StringComparer.OrdinalIgnoreCase)
        {
            // Иностранные слова
            "кофе", "кенгуру", "авокадо", "какао", "пальто", "радио", "жюри", "шимпанзе", "такси", "шасси",
            "меню", "депо", "кино", "пианино", "бра", "поло", "пари", "шоу", "кабрио", "авеню", "фойе",
            "буржуа", "маэстро", "попурри", "фугу", "инженю", "денди", "каталог", "салями", "вето", "эсперанто",
            "инкогнито", "досье", "пари", "бюро", "гангстер", "колибри", "граффити", "рэпер", "аллегро", "фреско",
            "долби", "алиби", "монпансье", "шампанское", "треугольник", "кларнет", "коктейль", "дизель", "танго",

            // Русские имена
            "Галина", "Лариса", "Нина", "Зинаида", "Марина", "Ирина", "Любовь",

            // Иностранные имена
            "Альберто", "Пьер", "Жан", "Эмиль", "Карлос", "Луис", "Моника", "Ева", "Софи", "Мари",

            // Географические названия
            "Одесса", "Кавказ", "Алтай", "Москва", "Сочи", "Пермь", "Енисей", "Европа", "Азия", "Африка",
            "Токио", "Париж", "Мехико", "Кито", "Рио-де-Жанейро", "Торонто", "Монтевидео",

            // Сложные слова
            "верхне-волжский", "полуботинки", "вечнозеленый", "вице-президент",

            // Другие
            "авеню", "депо", "кино", "макароны", "попугай", "радио", "рельсы",
            "табу", "тюль",

            // Несклоняемые прилагательные (часто используемые)
            "бежевый", "бордовый", "голубой", "лиловый", "оранжевый", "розовый",
            "сиреневый", "фиолетовый", "хаки",

            // Несклоняемые наречия (часто используемые)
            "вчера", "сегодня", "завтра", "позавчера", "вдруг", "вряд ли", "потом",
            "здесь", "там", "справа", "слева", "вверху", "внизу", "вдали", "вблизи",
            "вдвоем", "втроем", "вчетвером", "по-моему",

            // Числительные
            "два", "три", "пять", "шесть", "семь", "восемь", "девять", "десять", "полтора",
            "полтораста",
            // Другие
            "мимо", "вокруг", "внутри", "сквозь", "ой", "ах", "ура", "да", "нет",
            "как", "что", "где", "когда", "почему", "зачем", "кто", "чтобы",
            "если", "тогда", "хотя", "также", "однако", "например", "однако",
            "поэтому", "следовательно", "вместо", "потому", "после", "перед",
            "впереди", "позади", "во время", "напротив", "посредством",
            "вместе", "раздельно", "отдельно", "самостоятельно", "бесплатно",
            "пожалуйста", "спасибо", "извини", "прости", "извини", "добрый день",
            "доброе утро", "добрый вечер", "до свидания", "счастливо", "пока",
            "извини", "прости", "удачи", "прекрасно", "отлично"
        };
    }
}
